snlkuharlocal/src/Documents/ЛистМаркировкиОстатков/ЛистМаркировкиОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистМаркировкиОстатков</name>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКоробки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодКоробки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПолный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьКоробки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБлочков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЛистМаркировкиОстатков/ObjectModule.bsl
#Область СобытияОбъекта
	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь);
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда
		ДокОснование = ДанныеЗаполнения;	
	КонецЕсли;
	
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаданиеНаМаркировку") Тогда		
		рОснования	= ПолучитьРеквизитыШапки(ДокОснование, "Организация,Подразделение,Дата,фАгрегироватьКоробки,фАгрегироватьБлочки");		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, рОснования);
		
		ДокОснование	= ДанныеЗаполнения;
		Дата			= Дата + 1;	
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	Если Модифицированность() Тогда
		КоличествоДокумента = ШтрихкодыУпаковок.Количество();		 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДокОснование) И ПолучитьРеквизитШапки(ДокОснование, "Дата") = Дата Тогда
		Дата = Дата + 1;	
	КонецЕсли;
	
	Если Номенклатура.Пустая() Тогда
		Если ШтрихкодыУпаковок.Количество() > 0 Тогда
			Номенклатура = ШтрихкодыУпаковок[0].ШтрихкодУпаковки.Владелец;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ ШтрихкодКоробки.Пустая() Тогда	
		рПроверки = ШтрихКодКоробкиУникален(ШтрихкодКоробки);
		Если НЕ рПроверки.Успешно Тогда		
			Отказ = Истина;
			ВызватьИсключение "Не уникален код коробки: " + ШтрихкодКоробки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = ПараметрыСеанса.Пользователь;
	ШтрихкодыУпаковок.Очистить();
	
	СостояниеНакладной	= Перечисления.СостоянияНакладной.ВРаботе;
	ШтрихкодКоробки		= Неопределено;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если Проведен И ШтрихкодыУпаковок.Количество() > 0 Тогда
		Отказ = Истина;
		#Если КЛИЕНТ Тогда
		Сообщить("Нельзя распроводить данные документы !");		 
		#КонецЕсли
	КонецЕсли; 
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(ДокОснование) Тогда
		Префикс = СокрЛП(ПолучитьРеквизитШапки(ДокОснование, "Номер"))+"/";	
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Если НЕ (Завершен ИЛИ Отменен) Тогда Возврат КонецЕсли;
	
	Местонахождение = ПолучитьРеквизитШапки(Ссылка, "ДокОснование.Подразделение");
	Для Каждого СтрокаКМ Из ШтрихкодыУпаковок Цикл
		Запись = Движения.СтатусыКМ_Факт.Добавить();	
		
		Запись.Период			= Дата;
		
		Запись.ШтрихКодУпаковки = СтрокаКМ.ШтрихкодУпаковки;	
		Запись.Местонахождение	= Местонахождение;
		
		Запись.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;
	КонецЦикла; 
	
	Если НеПолный ИЛИ Отменен Тогда
		Для Каждого ШтрихкодУпаковки Из ПолучитьНеНанесенныеКодыЛенты() Цикл
			Запись = Движения.СтатусыКМ_Факт.Добавить();	
		
			Запись.Период			= Дата;	
		
			Запись.ШтрихКодУпаковки = ШтрихкодУпаковки;	
			Запись.Местонахождение	= Местонахождение;
		
			Запись.Статус			= Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати;			
		КонецЦикла;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ШтрихкодКоробки) Тогда			
		
		Если НеПолный ИЛИ Отменен Тогда
		    СтатусАгрКода	= Перечисления.СтатусыКодовМаркировкиФакт.Выбыл;
			ОчиститьКодАгрегации();
		Иначе	
			СтатусАгрКода	= Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;
			ЗаполнитьКодАгрегации();		
		КонецЕсли;		
		
		Запись = Движения.СтатусыКМ_Факт.Добавить();	
		
		Запись.Период			= Дата;
		
		Запись.ШтрихКодУпаковки = ШтрихкодКоробки;
		Запись.Местонахождение	= Местонахождение;
		
		Запись.Статус			= СтатусАгрКода;
	КонецЕсли;    
	
КонецПроцедуры


#КонецОбласти 

Функция ПолучитьНеНанесенныеКодыЛенты()
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ
	|	ВсеКодыЛенты.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок КАК ВсеКодыЛенты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ЛистМаркировкиОстатков.ШтрихкодыУпаковок КАК КодыВЛМ
	|ПО
	|	КодыВЛМ.Ссылка = &ЛистМаркировки 
	|	И КодыВЛМ.ШтрихкодУпаковки = ВсеКодыЛенты.ШтрихкодУпаковки
	|ГДЕ
	|	ВсеКодыЛенты.Ссылка = &Задание
	|	И ВсеКодыЛенты.ЛистМаркировки = &ЛистМаркировки
	|	И КодыВЛМ.ШтрихкодУпаковки ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("Задание", 		ДокОснование);
	Запрос.УстановитьПараметр("ЛистМаркировки", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
КонецФункции //ПолучитьНеНанесенныеКодыЛенты()

Процедура ЗаполнитьКодАгрегации()
	
	Владелец = ПолучитьРеквизитШапки(ШтрихкодКоробки, "Владелец");
	Если Владелец.Пустая() И ШтрихкодКоробки.ВложенныеШтрихкоды.Количество() = 0 Тогда
		СпрОбъект = ШтрихкодКоробки.ПолучитьОбъект();
		
		СпрОбъект.Владелец = Номенклатура;
		Для Каждого СтрокаКМ Из ШтрихкодыУпаковок Цикл
			СтрокаК = СпрОбъект.ВложенныеШтрихкоды.Добавить();
			СтрокаК.Штрихкод = СтрокаКМ.ШтрихкодУпаковки;
		КонецЦикла;
		СпрОбъект.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура ОчиститьКодАгрегации()
	
	Владелец = ПолучитьРеквизитШапки(ШтрихкодКоробки, "Владелец");
	Если НЕ Владелец.Пустая() ИЛИ ШтрихкодКоробки.ВложенныеШтрихкоды.Количество() > 0 Тогда
		СпрОбъект = ШтрихкодКоробки.ПолучитьОбъект();
		
		СпрОбъект.Владелец = Неопределено;
		СпрОбъект.ВложенныеШтрихкоды.Очистить();
		
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ШтрихКодКоробкиУникален(мШтрихкодКоробки) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Документ.ЛистМаркировкиОстатков
	|ГДЕ
	|	ШтрихкодКоробки = &ШтрихкодКоробки
	|	И НеПолный = Ложь
	|	И Ссылка <> &Ссылка
	|";
	
	Запрос.УстановитьПараметр("ШтрихкодКоробки",	мШтрихкодКоробки);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат.Ошибки.Добавить(СтрШаблон("Коробка '%1' уже собрана документом: '%2' !", мШтрихкодКоробки, Выборка.Ссылка));
		Результат.Успешно = Ложь;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ШтрихКодКоробкиУникален()
